cfe llm/Catalogs/AI_RAGКоллекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_RAGКоллекции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.AI_RAG</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеКоллекции</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоллекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоллекцияИнициализирована</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Overlap</Name>					<Comment>Еще не используется</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыДанныхКоллекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеТипаСтрокой</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_RAGКоллекции/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьКоллекцииПоПредставлениюТипа(НаименованиеТипаСтрокой) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_RAGКоллекцииТипыДанныхКоллекции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AI_RAGКоллекции.ТипыДанныхКоллекции КАК AI_RAGКоллекцииТипыДанныхКоллекции
		|ГДЕ
		|	AI_RAGКоллекцииТипыДанныхКоллекции.НаименованиеТипаСтрокой = &НаименованиеТипаСтрокой";
	
	Запрос.УстановитьПараметр("НаименованиеТипаСтрокой", НаименованиеТипаСтрокой);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьЗначенияКоллекций(МассивКоллекций) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_RAGКоллекции.Наименование КАК Наименование,
		|	AI_RAGКоллекции.ОписаниеКоллекции КАК ОписаниеКоллекции,
		|	AI_RAGКоллекции.ТипКоллекции КАК ТипКоллекции,
		|	AI_RAGКоллекции.КоллекцияИнициализирована КАК КоллекцияИнициализирована,
		|	AI_RAGКоллекции._Overlap КАК _Overlap,
		|	AI_RAGКоллекции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AI_RAGКоллекции КАК AI_RAGКоллекции
		|ГДЕ
		|	AI_RAGКоллекции.Ссылка В(&МассивКоллекций)";
	Запрос.УстановитьПараметр("МассивКоллекций", МассивКоллекций);
	
	ИтоговоеСоответствие = Новый Соответствие;

	// Значения — строки таблицы: выборка одна на все ключи и после цикла
	// показывала бы для каждой коллекции последнюю запись.
	Для Каждого СтрокаКоллекции Из Запрос.Выполнить().Выгрузить() Цикл
		ИтоговоеСоответствие.Вставить(СтрокаКоллекции.Ссылка, СтрокаКоллекции);
	КонецЦикла;
	
	Возврат ИтоговоеСоответствие;
	
КонецФункции

#КонецОбласти
